test-results/output-corretto-11/ab_output.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /greetings
Document Length:        26 bytes

Concurrency Level:      5
Time taken for tests:   1.701 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      725000 bytes
HTML transferred:       130000 bytes
Requests per second:    2940.18 [#/sec] (mean)
Time per request:       1.701 [ms] (mean)
Time per request:       0.340 [ms] (mean, across all concurrent requests)
Transfer rate:          416.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     0    1   5.4      1     171
Waiting:        0    1   5.4      1     171
Total:          1    2   5.4      1     172

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      3
  98%      4
  99%      4
 100%    172 (longest request)